In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages
Requirement already satisfied: python-dateutil>=2 in c:\programdata\anaconda3\lib\site-packages (from pandas)
Requirement already satisfied: pytz>=2011k in c:\programdata\anaconda3\lib\site-packages (from pandas)
Requirement already satisfied: numpy>=1.7.0 in c:\programdata\anaconda3\lib\site-packages (from pandas)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2->pandas)

In [2]:
#import the pandas library and aliasing as pd
import pandas as pd
import numpy as np

In [3]:
#Without passing index
#numpy array
arr = np.array(['a','b','c','d'])
print(arr)

['a' 'b' 'c' 'd']

In [4]:
#creating the series using numpy array
s = pd.Series(arr)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [5]:
#by passing index.
#numpy array
arr = np.array(['a','b','c','d'])

#creating series
s = pd.Series(arr,index=[100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

In [6]:
# Ex1)
data = {'a' : 0, 'b' : 1, 'c' : 2}
s = pd.Series(data)
s

a    0
b    1
c    2
dtype: int64

In [7]:
# Create a Series from Scalar
s = pd.Series(5, index=[0, 1, 2, 3])
s

0    5
1    5
2    5
3    5
dtype: int64

In [8]:
# Data in the series can be accessed similar to that in an ndarray.
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
s[0]

1

In [10]:
# first 3 elements
s[0:3]   #[start,stop,step] # remember stop is exclusive

0    1
1    2
2    3
dtype: int64

In [11]:
# last 3 elements
s[-3:]

2    3
3    4
4    5
dtype: int64

In [12]:
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
#retrieve a single element
s['a']

1

In [16]:
#retrieve a multiple elements
s[['a','b','c']]

a    1
b    2
c    3
dtype: int64

In [17]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [18]:
s.values

array([1, 2, 3, 4, 5], dtype=int64)

In [19]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [20]:
name = ['kaushik', 'sushmitha', 'bhaskar', 'lakshmi']
age = [22,23,24,25]

# creating dictionary
data = {'Name':name,'Age':age}
print(data)
# passing dictionary to create df
df = pd.DataFrame(data)
df

{'Name': ['kaushik', 'sushmitha', 'bhaskar', 'lakshmi'], 'Age': [22, 23, 24, 25]}

   Age       Name
0   22    kaushik
1   23  sushmitha
2   24    bhaskar
3   25    lakshmi

In [21]:
#Ex2) with index
name = ['kaushik', 'sushmitha', 'bhaskar', 'lakshmi']
age = [22,23,24,25]

# my new indexes
indexes = ['rank1','rank2','rank3','rank4']

#this is my dictionary
data = {'Name':name,'Age':age}

#passing dictionary to create dataframe
df = pd.DataFrame(data, index=indexes)
df

       Age       Name
rank1   22    kaushik
rank2   23  sushmitha
rank3   24    bhaskar
rank4   25    lakshmi

In [22]:
df['Age']

rank1    22
rank2    23
rank3    24
rank4    25
Name: Age, dtype: int64

In [23]:
df.Age

rank1    22
rank2    23
rank3    24
rank4    25
Name: Age, dtype: int64

In [24]:
# say suppose you want to add city column 
city = ['Banglore','Pune','Hyderabad','Mumbai']

#adding new column named 'City'
df["City"] = city
df

       Age       Name       City
rank1   22    kaushik   Banglore
rank2   23  sushmitha       Pune
rank3   24    bhaskar  Hyderabad
rank4   25    lakshmi     Mumbai

In [26]:
df.City

rank1     Banglore
rank2         Pune
rank3    Hyderabad
rank4       Mumbai
Name: City, dtype: object

In [27]:
del df["City"]
df

       Age       Name
rank1   22    kaushik
rank2   23  sushmitha
rank3   24    bhaskar
rank4   25    lakshmi

In [28]:
df.pop('Age')
df

            Name
rank1    kaushik
rank2  sushmitha
rank3    bhaskar
rank4    lakshmi

In [29]:
df.push('Age')
df

AttributeError: 'DataFrame' object has no attribute 'push'